{
  "scrolls": [
    {
      "file": "spectral_theorem.html",
      "title": "The Spectral Theorem for Symmetric Matrices",
      "authors": "Dr. Victor Frankenstein, Captain Nemo",
      "abstract": "The spectral theorem establishes that symmetric matrices can be diagonalized by orthogonal transformations. This fundamental result connects linear algebra with geometric intuition and enables applications from optimization to quantum mechanics. We present the theorem with proof and demonstrate its power through concrete examples.",
      "keywords": [
        "mathematics",
        "linear algebra",
        "spectral theorem",
        "Typst"
      ],
      "user": "Pavel Kowalski",
      "subject": "Mathematics",
      "license": "cc-by-4.0"
    },
    {
      "file": "iris_analysis.html",
      "title": "Interactive Analysis of the Iris Dataset",
      "authors": "Sherlock Holmes, Alice Liddell",
      "abstract": "The Iris dataset is a classic multivariate dataset used for classification and visualization. This paper provides an interactive exploratory analysis using Python and Plotly, demonstrating species clustering through petal and sepal measurements. Interactive visualizations enable readers to explore the data patterns that make this dataset ideal for demonstrating machine learning classification algorithms.",
      "keywords": [
        "data science",
        "machine learning",
        "Quarto",
        "interactive plots",
        "classification"
      ],
      "user": "Anita Patel",
      "subject": "Computer Science",
      "license": "cc-by-4.0"
    },
    {
      "file": "damped_oscillators.html",
      "title": "Damped Harmonic Oscillators: Three Characteristic Regimes",
      "authors": "Dr. Henry Jekyll, Elizabeth Bennet",
      "abstract": "The damped harmonic oscillator extends the simple harmonic oscillator by incorporating energy dissipation. This paper examines the three characteristic regimes—underdamped, critically damped, and overdamped—and demonstrates how the damping coefficient fundamentally determines system behavior. An interactive simulation enables exploration of parameter space, building intuition for this fundamental physical system.",
      "keywords": [
        "physics",
        "oscillators",
        "damping",
        "interactive simulation",
        "RSM"
      ],
      "user": "Sarah Kim",
      "subject": "Physics",
      "license": "cc-by-4.0"
    },
    {
      "file": "graph_traversal.html",
      "title": "Graph Traversal Algorithms: BFS and DFS",
      "authors": "Dorothy Gale, Huckleberry Finn",
      "abstract": "Graph traversal algorithms systematically visit vertices in a graph. This paper examines the two fundamental approaches: Breadth-First Search (BFS) explores level-by-level, while Depth-First Search (DFS) explores as deep as possible before backtracking. Understanding their distinct characteristics is essential for selecting the appropriate algorithm for path-finding, connectivity analysis, and graph-based problem solving.",
      "keywords": [
        "algorithms",
        "graph theory",
        "BFS",
        "DFS",
        "Jupyter"
      ],
      "user": "John Smith",
      "subject": "Computer Science",
      "license": "cc-by-4.0"
    }
  ]
}
